---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.GetDeformedShapeSettings
source: html/7649f0c1-7724-e74c-c98f-4cdf3954f658.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.GetDeformedShapeSettings Method

Get deformed shape settings object from the style.

## Syntax (C#)
```csharp
public AnalysisDisplayDeformedShapeSettings GetDeformedShapeSettings()
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - deformed shape settings were not created with the object.